---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArrayIterator.#ctor
source: html/6e69d147-c4c5-c5a8-5584-09f8aa908075.htm
---
# Autodesk.Revit.DB.ReferencePointArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ReferencePointArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.